{
  "html5shiv": "<!--[if lt IE 9]>\r\n<script src=\"//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv.min.js\"></script>\r\n<![endif]-->",
  "index01": "This project holds tests for the skipole web framework. Each widget, validator and responder has its own page. Follow the buttons below to each area of tests.",
  "index02": "The buttons above consist of links.ButtonLink1 widgets.",
  "no_javascript_text": "JAVASCRIPT FAILURE\r\n\r\nThis page is shown because the script on the previous page has failed to run.\r\n\r\nThis could be due to either a failure in the script, or your browser has javascript disabled.",
  "page.100101.01": "Access to the 'secure1' page should only be allowed once you have input the password 'password1'.\r\n\r\nFirst check that you cannot access the secure1 page, then check that an invalid password fails. Then try 'password1' - and you should be taken directly to secure1. This should set a session cookie into your browser.\r\n\r\nThen test that you can subsequently go to the secure1 page without the password, until your browser is closed, and the cookie is lost, or until you have used the logout function in secure1.",
  "page.100101.02": "Similarly, access to the 'secure2' page should only be allowed once you have input the password 'password2' below.\r\n\r\nHowever in this case, rather than a session cookie, a cookie with a one minute expiry time is used instead, so even if the browser is shut down, and re-started, access will still be available to a logged on user if no more than one minute has elapsed.",
  "page.100101.03": "This test uses basic http authentication and if you are not logged in, will open a username/password dialog. This will give access to the secure3 page once you have input any username longer than three characters, and the password of 'password3'.\r\n\r\nPlease note: this test should work with the Python built-in web server, but may not work with some http servers which may not allow authentication headers through.",
  "page.100102.01": "This is the 'secure1' page.  You should only be able to access this page when you have used the password 'password1' in the Test Login page.",
  "page.100102.02": "You can remain logged in and return to the home or login pages using the left navigation buttons. While logged in you will still be able to access this page.\r\n\r\nOr you can log out using the button below, which will then deny you access to this page until you again enter the password.",
  "page.100104.01": "This is the 'secure2' page.  You should only be able to access this page when you have used the password 'password2' in the Test Login page.",
  "page.100104.02": "You can remain logged in and return to the home or login pages using the left navigation buttons. While logged in you will still be able to access this page.\r\n\r\nOr you can log out using the button below, which will then deny you access to this page until you again enter the password.",
  "page.100106.01": "This is the secure3 page - you can see this page once you have input any username longer than three characters, and the password of 'password3'.\r\n\r\nThis uses basic authentication - and you will stay logged in until your browser is closed, or if your browser implements a time-out.",
  "page.200001.01": "Responders are pages which receive a call, and then manipulates the received data in some way, including calling your submit_data function to populate the page_data dictionary.\r\n\r\nThe responder then generally passes the call to a final template page which is returned to the client browser.\r\n\r\nThe following buttons link to tests for each responder type.",
  "page.3001.01": "Widgets are defined in modules - use the buttons below to the module required.",
  "page.3002.01": "These are the widgets in the checkbox module.",
  "page.3003.01": "These are the widgets in the confirm module.",
  "page.3006.01": "These are the widgets in the paras module.",
  "page.3007.01": "These are the widgets in the links module.",
  "page.3008.01": "These are the widgets in the error_messages module.",
  "page.3009.01": "These are the widgets in the inputforms module.",
  "page.5002.01": "A checkbox in a div - but without a form or submit button, typically included within a form. On error, a paragraph above the checkbox will display the error message.",
  "page.5002.02": "Submitting the form should give the checkbox result here.",
  "page.5002.03": "The button below sets an error into the checkbox and refreshes the page. This causes the textblock to be set to its original unticked state, since these tests are not retaining the state.",
  "page.5002.04": "The following calls a JSON file to set the checkbox above to ticked.",
  "page.5002.05": "The following calls a JSON file to set the checkbox above to unticked.",
  "page.5002.06": "The following calls a JSON file to set an error into the checkbox.",
  "page.5002.07": "The following calls a JSON file to clear a current error condition in the checkbox.",
  "page.5010.01": "A span holding a checkbox. Without a form or submit button, typically included within a form. Does not display errors.",
  "page.5010.02": "Submitting the form should give the checkbox result here.",
  "page.5010.03": "The following calls a JSON file to set the checkbox above to ticked.",
  "page.5010.04": "The following calls a JSON file to set the checkbox above to unticked.",
  "page.5020.01": "A div containing a checkbox and text input field. Without a form or submit button, typically included within a form.\r\nThe text input field is only enabled when the checkbox is checked. Uses javascript and jquery to enable/disable the text input field.",
  "page.5020.02": "Submitting the form should give the checkbox result here.",
  "page.5020.03": "The following calls a JSON file to set the checkbox above to ticked.",
  "page.5020.04": "The following calls a JSON file to set the checkbox above to unticked.",
  "page.5101.01": "A table of a single text column, followed by a button link column.\r\nThere is a header and title over the text column, the button link can have one get field.",
  "page.5201.01": "An ErrorDiv widget is set below this paragraph, normally invisible until an error condition is raised, at which point it will show the error message."
}